jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
/*
 * Copyright (C) 2009 Jon Howell (jonh@jonh.net) and Jeremy Elson
 * (jelson@gmail.com).
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "core/hal.h"
#include "core/hardware.h"
#include "core/logging.h"
#include "periph/uart/uart_hal.h"
#include "stm32.h"

#if defined(RULOS_ARM_stm32g0) || defined(RULOS_ARM_stm32g4)
#define USE_RX_DMA_FOR_CHIP 1
#include "core/dma.h"
#else
#define USE_RX_DMA_FOR_CHIP 0
#endif

//////////////////////////////////////////////////////////////////////////////

typedef struct {
  // housekeeping
  bool initted;
  bool rx_gpio_initted;
  bool tx_gpio_initted;

  // RULOS HAL API: the upcall to get more data and the user data for that
  // callback
  uint8_t uart_id;
  void *user_data;

  // tx
  hal_uart_next_sendbuf_cb next_sendbuf_cb;

  // rx
  hal_uart_receive_cb rx_cb;
  char *rx_buf;
  // buflen we're given by the layer above, divided by two: size of each half
  size_t rx_half_buflen;
  bool rx_cb_ready;    // has the previous call to rx_cb completed?
  bool rx_data_ready;  // have we received an idle interrupt?

  // rx--interrupt mode only
  char *rx_curr_base_buf;  // points to rx_buf, or halfway into rx_buf
  size_t rx_bytes_stored;  // number of bytes received

  // UART handle from STM32's HAL
  UART_HandleTypeDef hal_uart_handle;

  // Transmit and receive DMA buffers and DMA handles
  DMA_HandleTypeDef hal_dma_tx_handle;

  // statistics
  uint32_t tot_ints;
  uint32_t tot_rx_bytes;
  uint32_t tot_tx_bytes;
  uint32_t dropped_rx_bytes;
  uint32_t frame_errors;
  uint32_t parity_errors;
  uint32_t noise_errors;
  uint32_t overruns;
  uint32_t idle_ints;
  uint16_t min_chars_per_rx_isr;
  uint16_t max_chars_per_rx_isr;
  uint16_t max_chars_per_tx_batch;
  uint16_t max_chars_per_rx_batch;
} stm32_uart_t;

/// Configuration

typedef struct {
  // general
  USART_TypeDef *instance;
  IRQn_Type instance_irqn;
  uint32_t altfunc;

  // rx
  GPIO_TypeDef *rx_port;
  uint32_t rx_pin;
  DMA_TypeDef *rx_dma_instance;
  int rx_dma_channel;
  IRQn_Type rx_dma_irqn;
  uint32_t rx_dma_request;

  // tx
  GPIO_TypeDef *tx_port;
  uint32_t tx_pin;
  DMA_Channel_TypeDef *tx_dma_chan;
  IRQn_Type tx_dma_irqn;
  uint32_t tx_dma_request;
} stm32_uart_config_t;

static void on_usart_interrupt(uint8_t uart_id);
static void dispatch_tx_dma(uint8_t uart_id);
static void config_gpio(const stm32_uart_config_t *config, bool rx);

#if USE_RX_DMA_FOR_CHIP
static void on_rx_dma_interrupt(uint8_t uart_id);
#endif

///////////// stm32f0

#if defined(RULOS_ARM_stm32f0)

#include "stm32f0xx_ll_usart.h"
static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,
        .rx_port = GPIOA,
        .rx_pin = GPIO_PIN_10,
        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_9,
        .tx_dma_chan = DMA1_Channel2,
        .tx_dma_irqn = DMA1_Channel2_3_IRQn,
        .altfunc = GPIO_AF1_USART1,
    },
};

void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

void DMA1_Channel2_3_IRQHandler() {
  dispatch_tx_dma(0);
}

///////////// stm32f1

#elif defined(RULOS_ARM_stm32f1)

#include "stm32f1xx_ll_usart.h"
static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,
        .rx_port = GPIOA,
        .rx_pin = GPIO_PIN_10,
        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_9,
        .tx_dma_chan = DMA1_Channel4,
        .tx_dma_irqn = DMA1_Channel4_IRQn,
    },
};

void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

void DMA1_Channel4_IRQHandler() {
  dispatch_tx_dma(0);
}

///////////// stm32f3

#elif defined(RULOS_ARM_stm32f3)

void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

void DMA1_Channel4_IRQHandler() {
  dispatch_tx_dma(0);
}

#include "stm32f3xx_ll_usart.h"
static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,
        .rx_port = GPIOA,
        .rx_pin = GPIO_PIN_10,
        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_9,
        .tx_dma_chan = DMA1_Channel4,
        .tx_dma_irqn = DMA1_Channel4_IRQn,
        .altfunc = GPIO_AF7_USART1,
    },
};

///////////// stm32g0

#elif defined(RULOS_ARM_stm32g0)

// Summary of stm32g0 uart DMA channels
//
// unit:channel

// (rulos_id) stm32_id  dma_rx  dma_tx
//      (0)      1        1:2     1:1
//      (1)      2        1:3     1:4
//      (2)      3        2:1     1:5
//      (3)      4        2:2     1:6
//      (4)      5        2:3     1:7
//      (5)      6        2:4     2:5

void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

void DMA1_Channel1_IRQHandler() {
  dispatch_tx_dma(0);
}

#ifndef UART_SURRENDER_DMA1_CHAN2_3

void DMA1_Channel2_3_IRQHandler() {
  on_rx_dma_interrupt(0);
  on_rx_dma_interrupt(1);
}

#endif  // UART_SURRENDER_DMA1_CHAN2_3

#if STM32G0B1xx
#define USART2_IRQn USART2_LPUART2_IRQn
void USART2_LPUART2_IRQHandler() {
  on_usart_interrupt(1);
}

void DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQHandler() {
  dispatch_tx_dma(1);
  dispatch_tx_dma(2);
  dispatch_tx_dma(3);
  dispatch_tx_dma(4);
  dispatch_tx_dma(5);

  on_rx_dma_interrupt(2);
  on_rx_dma_interrupt(3);
  on_rx_dma_interrupt(4);
  on_rx_dma_interrupt(5);
}

void USART3_4_5_6_LPUART1_IRQHandler() {
  on_usart_interrupt(2);
  on_usart_interrupt(3);
  on_usart_interrupt(4);
  on_usart_interrupt(5);
}

#else
void USART2_IRQHandler() {
  on_usart_interrupt(1);
}
void DMA1_Ch4_5_DMAMUX1_OVR_IRQHandler() {
  dispatch_tx_dma(1);
}
#endif

static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

        .rx_port = GPIOA,
        .rx_pin = GPIO_PIN_10,
#ifndef UART_SURRENDER_DMA1_CHAN2_3
        //. comment out line below to test interrupt mode
        .rx_dma_instance = DMA1,
        .rx_dma_channel = LL_DMA_CHANNEL_2,
        .rx_dma_irqn = DMA1_Channel2_3_IRQn,
        .rx_dma_request = DMA_REQUEST_USART1_RX,
#endif  // UART_SURRENDER_DMA1_CHAN2_3

        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_9,
        .tx_dma_chan = DMA1_Channel1,
        .tx_dma_irqn = DMA1_Channel1_IRQn,
        .tx_dma_request = DMA_REQUEST_USART1_TX,
        .altfunc = GPIO_AF1_USART1,
    },
    {
        .instance = USART2,
        .instance_irqn = USART2_IRQn,
        .rx_port = GPIOA,
#ifdef USART2_RX_ON_A15
        .rx_pin = GPIO_PIN_15,
#else
        .rx_pin = GPIO_PIN_3,
#endif
#ifndef UART_SURRENDER_DMA1_CHAN2_3
        .rx_dma_instance = DMA1,
        .rx_dma_channel = LL_DMA_CHANNEL_3,
        .rx_dma_irqn = DMA1_Channel2_3_IRQn,
        .rx_dma_request = DMA_REQUEST_USART2_RX,
#endif

        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_2,
        .tx_dma_chan = DMA1_Channel4,
#if STM32G0B1xx
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
#else
        .tx_dma_irqn = DMA1_Ch4_5_DMAMUX1_OVR_IRQn,
#endif
        .tx_dma_request = DMA_REQUEST_USART2_TX,
        .altfunc = GPIO_AF1_USART2,
    },
#ifdef USART3
    {
        .instance = USART3,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_port = GPIOB,
        .rx_pin = GPIO_PIN_9,
        .rx_dma_instance = DMA2,
        .rx_dma_channel = LL_DMA_CHANNEL_3,
        .rx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .rx_dma_request = DMA_REQUEST_USART3_RX,

