jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
        .tx_port = GPIOB,
        .tx_pin = GPIO_PIN_2,
        .tx_dma_chan = DMA1_Channel5,
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .tx_dma_request = DMA_REQUEST_USART3_TX,
        .altfunc = GPIO_AF4_USART3,
    },
#endif
#ifdef USART4
    {
        .instance = USART4,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_port = GPIOA,
        .rx_pin = GPIO_PIN_1,
        .rx_dma_instance = DMA2,
        .rx_dma_channel = LL_DMA_CHANNEL_4,
        .rx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .rx_dma_request = DMA_REQUEST_USART4_RX,

        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_0,
        .tx_dma_chan = DMA1_Channel6,
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .tx_dma_request = DMA_REQUEST_USART4_TX,
        .altfunc = GPIO_AF4_USART4,
    },
#endif
#ifdef USART5
    {
        .instance = USART5,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_port = GPIOB,
#ifdef USART5_RX_ON_B4
        .rx_pin = GPIO_PIN_4,
#else
        .rx_pin = GPIO_PIN_1,
#endif
        .rx_dma_instance = DMA2,
        .rx_dma_channel = LL_DMA_CHANNEL_5,
        .rx_dma_request = DMA_REQUEST_USART5_RX,

        .tx_port = GPIOB,
        .tx_pin = GPIO_PIN_0,
        .tx_dma_chan = DMA1_Channel7,
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .tx_dma_request = DMA_REQUEST_USART5_TX,
        .altfunc = GPIO_AF8_USART5,
    },
#endif
#ifdef USART6
    {
        .instance = USART6,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_port = GPIOA,
        .rx_pin = GPIO_PIN_5,
        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_4,
        .tx_dma_chan = DMA2_Channel5,
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .tx_dma_request = DMA_REQUEST_USART6_TX,
        .altfunc = GPIO_AF3_USART6,
    },
#endif
};

///////////// stm32g4

#elif defined(RULOS_ARM_stm32g4)

void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

void DMA1_Channel1_IRQHandler() {
  dispatch_tx_dma(0);
}

void DMA1_Channel2_IRQHandler() {
  on_rx_dma_interrupt(0);
}

static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

        .rx_port = GPIOA,
        .rx_pin = GPIO_PIN_10,
        .rx_dma_channel = LL_DMA_CHANNEL_2,
        .rx_dma_irqn = DMA1_Channel2_IRQn,
        .rx_dma_request = DMA_REQUEST_USART1_RX,

        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_9,
        .tx_dma_chan = DMA1_Channel1,
        .tx_dma_irqn = DMA1_Channel1_IRQn,
        .tx_dma_request = DMA_REQUEST_USART1_TX,
        .altfunc = GPIO_AF7_USART1,
    },
};

/////////////////////////////////////////

#else
#error "Tell the UART code about your chip's UART."
#include <stophere>
#endif

// Eventually this should be conditional depending on what kind of
// chip you have
#define NUM_UARTS (sizeof(stm32_uart_config) / sizeof(stm32_uart_config[0]))
static stm32_uart_t g_stm32_uarts[NUM_UARTS] = {};

#ifdef USE_RX_DMA_FOR_CHIP
#define USART_USING_RX_DMA(config) ((config)->rx_dma_instance != NULL)
#else
#define USART_USING_RX_DMA(config) (false)
#endif

///////////////////// reception /////////////////////////////

static void on_rx_buffer_full(uint8_t uart_id, stm32_uart_t *u,
                              const stm32_uart_config_t *c);

//// Receiving: DMA Version

#if USE_RX_DMA_FOR_CHIP

static void hal_uart_start_rx_dma(stm32_uart_t *u,
                                  const stm32_uart_config_t *config) {
  LL_DMA_DisableChannel(config->rx_dma_instance, config->rx_dma_channel);

  // Enable DMA RX interrupts
  NVIC_SetPriority(config->rx_dma_irqn, 0);
  NVIC_EnableIRQ(config->rx_dma_irqn);

  LL_DMA_ClearFlag_TC(config->rx_dma_instance, config->rx_dma_channel);
  LL_DMA_ConfigTransfer(config->rx_dma_instance, config->rx_dma_channel,
                        LL_DMA_DIRECTION_PERIPH_TO_MEMORY |
                            LL_DMA_PRIORITY_MEDIUM | LL_DMA_MODE_NORMAL |
                            LL_DMA_PERIPH_NOINCREMENT |
                            LL_DMA_MEMORY_INCREMENT | LL_DMA_PDATAALIGN_BYTE |
                            LL_DMA_MDATAALIGN_BYTE);

  LL_DMA_ConfigAddresses(
      config->rx_dma_instance, config->rx_dma_channel,
      LL_USART_DMA_GetRegAddr(config->instance, LL_USART_DMA_REG_DATA_RECEIVE),
      (uint32_t)u->rx_curr_base_buf,
      LL_DMA_GetDataTransferDirection(config->rx_dma_instance,
                                      config->rx_dma_channel));
  LL_DMA_SetDataLength(config->rx_dma_instance, config->rx_dma_channel,
                       u->rx_half_buflen);
  LL_DMA_SetPeriphRequest(config->rx_dma_instance, config->rx_dma_channel,
                          config->rx_dma_request);
  LL_DMA_EnableIT_TC(config->rx_dma_instance, config->rx_dma_channel);
  LL_USART_EnableDMAReq_RX(config->instance);
  LL_DMA_EnableChannel(config->rx_dma_instance, config->rx_dma_channel);
}

// Called when a DMA interrupt arrives for a UART. Determine if it is a
// completion interrupt, and if so, send an upcall.
static void on_rx_dma_interrupt(uint8_t uart_id) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *config = &stm32_uart_config[uart_id];

  if (!u->initted) {
    return;
  }

  u->tot_ints++;

  if (LL_DMA_IsActiveFlag_TC(config->rx_dma_instance, config->rx_dma_channel)) {
    LL_DMA_ClearFlag_TC(config->rx_dma_instance, config->rx_dma_channel);
    u->tot_rx_bytes += u->rx_half_buflen;
    on_rx_buffer_full(uart_id, u, config);
  }
}

static size_t get_rx_stored_chars_dma(uint8_t uart_id, stm32_uart_t *u,
                                      const stm32_uart_config_t *c) {
  // Disable DMA
  LL_DMA_DisableChannel(c->rx_dma_instance, c->rx_dma_channel);

  // Determine how many bytes are left to read, and thus how many were read
  const size_t free_space =
      LL_DMA_GetDataLength(c->rx_dma_instance, c->rx_dma_channel);
  const size_t rx_chars = u->rx_half_buflen - free_space;
  u->tot_rx_bytes += rx_chars;
  return rx_chars;
}

#else  // USE_RX_DMA_FOR_CHIP

