jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
static void hal_uart_start_rx_dma(stm32_uart_t *u,
                                  const stm32_uart_config_t *config) {
}

static size_t get_rx_stored_chars_dma(uint8_t uart_id, stm32_uart_t *u,
                                      const stm32_uart_config_t *c) {
  return 0;
}

#endif  // USE_RX_DMA_FOR_CHIP

//// Receiving: Per-Char Interrupt Version

static void hal_uart_start_rx_interrupt(stm32_uart_t *u,
                                        const stm32_uart_config_t *config) {
  LL_USART_EnableIT_RXNE(config->instance);
}

static void receive_char_int(uint8_t uart_id, stm32_uart_t *u,
                             const stm32_uart_config_t *config, char c) {
  // store the character
  u->rx_curr_base_buf[u->rx_bytes_stored] = c;
  u->rx_bytes_stored++;
  u->tot_rx_bytes++;

  // if the half-buffer has filled, make an upcall
  if (u->rx_bytes_stored == u->rx_half_buflen) {
    on_rx_buffer_full(uart_id, u, config);
  }
}

static size_t get_rx_stored_chars_int(uint8_t uart_id, stm32_uart_t *u,
                                      const stm32_uart_config_t *c) {
  return u->rx_bytes_stored;
}

//// Receiving: shared between DMA and Per-Char

static char *switch_rx_buffers(stm32_uart_t *u) {
  char *oldbuf = u->rx_curr_base_buf;
  if (oldbuf == u->rx_buf) {
    u->rx_curr_base_buf += u->rx_half_buflen;
  } else {
    u->rx_curr_base_buf = u->rx_buf;
  }
  u->rx_bytes_stored = 0;
  u->rx_data_ready = false;
  return oldbuf;
}

static void launch_next_rx(stm32_uart_t *u, const stm32_uart_config_t *config) {
  // launch a read on that buffer
  if (USART_USING_RX_DMA(config)) {
    hal_uart_start_rx_dma(u, config);
  } else {
    hal_uart_start_rx_interrupt(u, config);
  }
}

static void rx_send_up(uint8_t uart_id, stm32_uart_t *u, char *buf,
                       size_t len) {
  assert(u->rx_cb_ready);
  if (len > 0) {
    u->rx_cb_ready = false;
    u->rx_cb(uart_id, u->user_data, buf, len);
    if (len > u->max_chars_per_rx_batch) {
      u->max_chars_per_rx_batch = len;
    }
  }
}

// Maybe flush the RX buffer -- if there's data, and the upper layer is ready to
// receive
static void maybe_flush_rx_buf(uint8_t uart_id, stm32_uart_t *u,
                               const stm32_uart_config_t *c) {
  if (!u->rx_cb_ready) {
    return;
  }

  if (!u->rx_data_ready) {
    return;
  }

  size_t len = 0;
  if (USART_USING_RX_DMA(c)) {
    len = get_rx_stored_chars_dma(uart_id, u, c);
  } else {
    len = get_rx_stored_chars_int(uart_id, u, c);
  }

  char *oldbuf = switch_rx_buffers(u);
  launch_next_rx(u, c);
  rx_send_up(uart_id, u, oldbuf, len);
}

static void on_rx_buffer_full(uint8_t uart_id, stm32_uart_t *u,
                              const stm32_uart_config_t *c) {
  // RX buffer is full, so we better be done processing the other one! Otherwise
  // we have to drop it.
  if (!u->rx_cb_ready) {
    // uh oh!
    u->dropped_rx_bytes += u->rx_half_buflen;
  } else {
    char *oldbuf = switch_rx_buffers(u);
    rx_send_up(uart_id, u, oldbuf, u->rx_half_buflen);
  }
  launch_next_rx(u, c);
}

void hal_uart_start_rx(uint8_t uart_id, hal_uart_receive_cb rx_cb, void *buf,
                       size_t buflen) {
  /*
   * Use the Low-Level libraries (not the HAL) to set up the RX interrupt. Yeah,
   * it's a little weird to be using a mix of both HAL and LL. I wanted to use
   * the HAL libraries for the TX DMA, since it's complex. For RX, the HAL
   * libraries don't really do what we want - you have to give them a total
   * length you want to read, and then it shuts everything down again. We want
   * to just start receiving and never stop, with a simple interrupt every time
   * we receive a character.
   */
  assert(uart_id < NUM_UARTS);
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *config = &stm32_uart_config[uart_id];
  if (!u->rx_gpio_initted) {
    config_gpio(config, true);
    u->rx_gpio_initted = true;
  }

  u->rx_cb = rx_cb;
  u->rx_buf = buf;
  u->rx_curr_base_buf = u->rx_buf;
  u->rx_half_buflen = buflen / 2;
  u->rx_cb_ready = true;

  // If the hardware supports a UART FIFO, enable it
#ifdef LL_USART_ISR_RXNE_RXFNE
  LL_USART_EnableFIFO(config->instance);
#endif

  // clear spurious char that might be sitting in the rx register
  LL_USART_ReceiveData8(config->instance);

  // Enable the idle interrupt so we can flush rx buffers upwards when each
  // message ends
  LL_USART_ClearFlag_IDLE(config->instance);
  LL_USART_EnableIT_IDLE(config->instance);
  launch_next_rx(u, config);
}

static void on_usart_interrupt(uint8_t uart_id) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *c = &stm32_uart_config[uart_id];
  if (!u->initted) {
    return;
  }

  u->tot_ints++;

  // if a character arrived, add it to the rx buffer
  int num_read = 0;
  while (LL_USART_IsActiveFlag_RXNE(c->instance)) {
    // note: we have to read the character whether or not we send it anywhere;
    // reading the char is what clears the interrupt
    num_read++;
    receive_char_int(uart_id, u, c, LL_USART_ReceiveData8(c->instance));
  }

  // If we read anything, update some statistics
  if (num_read > 0) {
    if (num_read > u->max_chars_per_rx_isr) {
      u->max_chars_per_rx_isr = num_read;
    }
    if (u->min_chars_per_rx_isr == 0 || num_read < u->min_chars_per_rx_isr) {
      u->min_chars_per_rx_isr = num_read;
    }
  }

  // on idle interrupt, flush the rx buffers upwards
  if (LL_USART_IsActiveFlag_IDLE(c->instance)) {
    LL_USART_ClearFlag_IDLE(c->instance);
    u->idle_ints++;
    u->rx_data_ready = true;
    maybe_flush_rx_buf(uart_id, u, c);
  }

  // handle RX errors by clearing flags and updating statistics
  if (LL_USART_IsActiveFlag_FE(c->instance)) {
    LL_USART_ClearFlag_FE(c->instance);
    u->frame_errors++;
  }
  if (LL_USART_IsActiveFlag_PE(c->instance)) {
    LL_USART_ClearFlag_PE(c->instance);
    u->parity_errors++;
  }
  if (LL_USART_IsActiveFlag_NE(c->instance)) {
    LL_USART_ClearFlag_NE(c->instance);
    u->noise_errors++;
  }
  if (LL_USART_IsActiveFlag_ORE(c->instance)) {
    LL_USART_ClearFlag_ORE(c->instance);
    u->overruns++;
  }

  // dispatch the rest of the interrupt handling through the HAL
  HAL_UART_IRQHandler(&u->hal_uart_handle);
}

void hal_uart_rx_cb_done(uint8_t uart_id) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *c = &stm32_uart_config[uart_id];

